{
    "Cauliflower, Brown Rice, and Vegetable Fried Rice": {
        "title": "Cauliflower, Brown Rice, and Vegetable Fried Rice",
        "recipe_id": "716426",
        "instructions": "Remove the cauliflower's tough stem and reserve for another use. Using a food processor, pulse cauliflower florets until they resemble rice or couscous. You should end up with around four cups of \"cauliflower rice.\", Heat 1T butter and 1T oil in a large skillet over medium heat., Add garlic and the white and light green pieces of scallion. Sauté about a minute., Add the cauliflower to the pan. Stir to coat with oil, then spread out in pan and let sit; you want it cook a bit and to caramelize (get a bit brown), which will bring out the sweetness. After a couple of minutes, stir and spread out again., Add cold rice (it separates easily, so it won't clump up during cooking), plus the additional grapeseed and coconut oil or butter. Raise heat to medium-high. Toss everything together and, again, spread the mixture out over the whole pan and press a bit into the bottom., Let it sit for about two minutes—so the rice can get toasted and a little crispy., Add the peas and broccoli and stir again., Drizzle soy sauce and toasted sesame oil over rice.Cook for another minute or so and turn off heat., Add chopped scallion tops and toss.I like to toast some sesame seeds in a dry pan; I sprinkle these and some more raw, chopped scallion over the top of the rice for added flavor and crunch.Season to taste with salt and, if you'd like, more soy sauce. Keep in mind that if you're serving this with something salty and saucy (ie. teriyaki chicken) you may want to hold off on adding too much salt to the fried rice., ",
        "ingredients": "2 tablespoons grapeseed oil, 2 tablespoons coconut oil, 7 scallions, chopped (keep white/light green ends separate from dark green tops), 5 cloves of garlic, chopped, head of cauliflower, raw, 3 cups of cooked brown rice, cold, 2 cups cooked broccoli, chopped small, 1 cup frozen peas, 3 T reduced-sodium soy sauce, 2 teaspoons toasted sesame oil, toasted sesame seeds, optional, additional chopped scallion tops for garnish, salt, to taste, ",
        "image": "https://img.spoonacular.com/recipes/716426-556x370.jpg"
    },
    "Beef Carrot Stew": {
        "title": "Beef Carrot Stew",
        "recipe_id": "769754",
        "instructions": "",
        "ingredients": "",
        "image": "https://img.spoonacular.com/recipes/769754-312x231.jpg"
    },
    "Beef Cottage Pie": {
        "title": "Beef Cottage Pie",
        "recipe_id": "634605",
        "instructions": "",
        "ingredients": "",
        "image": "https://img.spoonacular.com/recipes/634605-312x231.jpg"
    },
    "Beef Lo Mein Noodles": {
        "title": "Beef Lo Mein Noodles",
        "recipe_id": "634629",
        "instructions": "",
        "ingredients": "",
        "image": "https://img.spoonacular.com/recipes/634629-312x231.jpg"
    },
    "Cheese Tortellini With Shrimp In Tomato Cream Sauce": {
        "title": "Cheese Tortellini With Shrimp In Tomato Cream Sauce",
        "recipe_id": "637593",
        "instructions": "",
        "ingredients": "",
        "image": "https://img.spoonacular.com/recipes/637593-312x231.jpg"
    },
    "Carrot Cake Pancakes": {
        "title": "Carrot Cake Pancakes",
        "recipe_id": "637184",
        "instructions": "",
        "ingredients": "",
        "image": "https://img.spoonacular.com/recipes/637184-312x231.jpg"
    },
    "Carrot Cake Muffin Cookies": {
        "title": "Carrot Cake Muffin Cookies",
        "recipe_id": "637181",
        "instructions": "",
        "ingredients": "",
        "image": "https://img.spoonacular.com/recipes/637181-312x231.jpg"
    },
    "Carrot-sesame seed bread": {
        "title": "Carrot-sesame seed bread",
        "recipe_id": "637243",
        "instructions": "",
        "ingredients": "",
        "image": "https://img.spoonacular.com/recipes/637243-312x231.jpg"
    },
    "Carrot and Ginger Soup": {
        "title": "Carrot and Ginger Soup",
        "recipe_id": "637165",
        "instructions": "",
        "ingredients": "",
        "image": "https://img.spoonacular.com/recipes/637165-312x231.jpg"
    },
    "3 Cheese Ravioli": {
        "title": "3 Cheese Ravioli",
        "recipe_id": "631863",
        "instructions": "",
        "ingredients": "",
        "image": "https://img.spoonacular.com/recipes/631863-312x231.jpg"
    },
    "test": {
        "title": "test",
        "recipe_id": "55555555555555555555",
        "instructions": "13513",
        "ingredients": "vjh",
        "image": "https://cdn.britannica.com/80/150980-050-84B9202C/Giant-panda-cub-branch.jpg"
    },
    "Beef Wellington": {
        "title": "Beef Wellington",
        "recipe_id": "75081",
        "instructions": "",
        "ingredients": "",
        "image": "https://img.spoonacular.com/recipes/75081-312x231.jpg"
    },
    "Beef Bourguignon": {
        "title": "Beef Bourguignon",
        "recipe_id": "634593",
        "instructions": "",
        "ingredients": "",
        "image": "https://img.spoonacular.com/recipes/634593-312x231.jpg"
    },
    "Beef Shanks Oso Bucco": {
        "title": "Beef Shanks Oso Bucco",
        "recipe_id": "634671",
        "instructions": "Place the rosemary, thyme, bay leaf and cloves into cheesecloth and secure with twine. This will be your bouquet garni.For the veal shanks, pat dry with paper towels to remove any excess moisture. Veal shanks will brown better when they are dry. Secure the meat to the bone with the kitchen twine. Season each shank with salt and freshly ground pepper. Dredge the shanks in flour, shaking off excess.In a large Dutch oven pot, heat vegetable oil until smoking., Add tied veal shanks to the hot pan and brown all sides, about 3 minutes per side., Remove browned shanks and reserve.In the same pot, add the onion, carrot and celery. Season with salt at this point to help draw out the moisture from the vegetables., Saute until soft and translucent, about 8 minutes., Add the tomato paste and mix well. Return browned shanks to the pan and add the white wine and reduce liquid by half, about 5 minutes., Add the bouquet garni and 2 cups of the chicken stock and bring to a boil.Reduce heat to low, cover pan and simmer for about 1 1/2 hours or until the meat is falling off the bone. Check every 15 minutes, turning shanks and adding more chicken stock as necessary. The level of cooking liquid should always be about 3/4 the way up the shank.Carefully remove the cooked shanks from the pot and place in decorative serving platter., Cut off the kitchen twine and discard., Remove and discard bouquet garni from the pot., Pour all the juices and sauce from the pot over the shanks., Garnish with chopped parsley and lemon zest., ",
        "ingredients": "All purpose flour, for dredging, 1 dry bay leaf, 3 pounds whole beef shanks (about 1 per shank), trimmed, 1 small carrot, diced into ½-inch cubes, 1 inch stalk celery, diced into ½ cubes, 3 cups chicken stock (or veal stock, beef stock or 1/2 cup vegetable oil, 3 tablespoons fresh flat-leaf Italian parsley, chopped, 1 sprig fresh rosemary, 1 sprig fresh thyme, 1 tablespoon lemon zest, 1 cup chopped onion, Sea salt and freshly ground black pepper, 1 tablespoon tomato paste, 1 cup white wine, 2 whole garlic cloves, Kitchen twine, for bouquet garni and tying the veal shanks, Cheesecloth, Cheesecloth, ",
        "image": "https://img.spoonacular.com/recipes/634671-556x370.jpg"
    },
    "Chia Seed Pudding": {
        "title": "Chia Seed Pudding",
        "recipe_id": "637832",
        "instructions": "Mix ingredients together in small bowl., Let sit overnight, top with your favorite berries and enjoy!, ",
        "ingredients": "1 tablespoon raw agave syrup, 1 1/2 cups (355 ml) almond milk (or your favorite flavored milk), 1/4 cup black chia seeds, Garnish: Raspberries (or your favorite berry), A pinch of salt, 1 teaspoon vanilla extract, ",
        "image": "https://img.spoonacular.com/recipes/637832-556x370.png"
    },
    "Smashed Fried Lemon Potatoes": {
        "title": "Smashed Fried Lemon Potatoes",
        "recipe_id": "660322",
        "instructions": "In a large pot of salted water place the well-scrubbed potatoes. Bring to a boil and cook until the potatoes are tender, about 20 minutes., Drain the potatoes and rinse with cold water. Using the palm, or the back of a large spatula, press the potatoes until slightly mashed.In a large skillet, heat the olive oil over medium high heat., Add the garlic and cook until slightly brown., Remove and toss., Add the potatoes and cook without stirring for about 5 to 10 minutes, the bottoms need to be a nice golden brown color. Using a spatula or cooking thongs, turn and cook another 5 to 8 minutes., Transfer to a plate.In a bowl mix together the lemon zest, lemon juice, olive oil, rosemary, parsley, thyme, vinegar and sea salt., Add the potatoes and coat them well gently., ",
        "ingredients": "1 ½ pound (24 oz. bag) fingerling potatoes, all the same size if possible, 1 tablespoon fresh chopped flat leaf Italian parsley, 1 teaspoon chopped fresh rosemary, 1 teaspoon chopped fresh thyme leaves, 2 garlic cloves peeled and end core removed, Juice of 1 large lemon, Zest of 1 large lemon, 2 tablespoon olive oil, 1 teaspoon red wine vinegar, ½ teaspoon sea salt, ",
        "image": "https://img.spoonacular.com/recipes/660322-556x370.png"
    },
    "Beef Tataki": {
        "title": "Beef Tataki",
        "recipe_id": "634698",
        "instructions": "",
        "ingredients": "",
        "image": "https://img.spoonacular.com/recipes/634698-312x231.jpg"
    },
    "Pan Con L'uva": {
        "title": "Pan Con L'uva",
        "recipe_id": "654396",
        "instructions": "",
        "ingredients": "",
        "image": "https://img.spoonacular.com/recipes/654396-312x231.jpg"
    }
}