{
    "Lemon Pie": {
        "title": "Lemon Pie",
        "recipe_id": "649730",
        "instructions": "Whip milk until thick, add condensed milk.   Thoroughly mix then add lemon juice., Pour in graham cracker crust.Chill and serve. Vanilla wafer crust is also good., ",
        "ingredients": "1 Graham cracker crust, 1/2 cup lemon juice and a little grated rind, 1 can carnation milk cold, 1 can sweetened condensed milk, ",
        "image": "https://img.spoonacular.com/recipes/649730-556x370.jpg"
    },
    "Beef Tataki": {
        "title": "Beef Tataki",
        "recipe_id": "634698",
        "instructions": "For 4 people, Heat grid well., Place beef on grid and grill on all sides. When the surface turns light brown, dip in ice water for a few seconds. Dry with a cloth, wrap in Saran Wrap and place in the refrigerator.Prepare condiments., Cut lemon into 8 wedges. Pare daikon in paper thin sheets, cutting with bottom part of knife while rotating the daikon., Roll daikon sheet and slice thinly crosswise, thus making very thin and long strips. Do the same with cucumber., Cut beef into thin slices., Place daikon strip, cucumber and beef slices in a serving dish. Put other condiments on the side., Place scallions on beef., Pour soy sauce into small individual serving dishes and add condiments to taste. The beef is dipped lightly in the soy sauce., ",
        "ingredients": "3/4 pound beef, tenderloin, 1 Japanese cucumber, 7 ounces daikon (Japanese radish), 2 teaspoons grated fresh ginger, 5 cloves garlic, minced, 1 lemon, Shiso leaves, Soy sauce, ",
        "image": "https://img.spoonacular.com/recipes/634698-556x370.jpg"
    },
    "hot dog": {
        "title": "hot dog",
        "recipe_id": "",
        "instructions": "",
        "ingredients": "",
        "image": "https://assets.tmecosys.com/image/upload/t_web767x639/img/recipe/ras/Assets/21861ad1f03b6136a02bf810234cd666/Derivates/d257bb4fe192628f00a98b1f08a7976fbf7f21d4.jpg"
    },
    "Apple Cake": {
        "title": "Apple Cake",
        "recipe_id": "632485",
        "instructions": "Preheat oven to 350F degrees.In a large bowl, mix together apples, oil, sugar, eggs and walnuts by hand., Mix well then set aside.In a separate bowl, mix flour, baking soda, salt, vanilla and cinnamon, Mix well then add to the apple mixture. The batter will be thick., Pour into ungreased 13x9 baking pan, and bake for one hour or until done., ",
        "ingredients": "3 cups sliced apples preferably Jonathan, 1 1/2 teaspoons baking soda, 1 teaspoon of cinnamon, 2 eggs, 2 1/2 cups flour, 1 1/2 cups oil, 1 teaspoon salt, 2 cups of sugar, 3 teaspoons vanilla (I increased this from 2 tsps. in original recipe), 1 cup chopped walnuts, ",
        "image": "https://img.spoonacular.com/recipes/632485-556x370.jpg"
    },
    "Chicken Wings": {
        "title": "Chicken Wings",
        "recipe_id": "638420",
        "instructions": "Add chicken into a large glass or stainless steel bowl, toss all the seasonings and brown sugar over the chicken.Cover with plastic wrap and refrigerate for an hour or two.Preheat the oven temperature to 400 degrees F., Place all the seasoned chicken onto a parchment lined baking sheet spread out so that they don't touch.  If you are doubling the recipe use two pans., Bake for 35 minutes.In a large bowl, add about 2 tablespoons of honey (or more if you like) and a few splashes of tabasco sauce (less or more to your liking)., Add the chicken, if it feels to hot to toss, wait a few minutes or use two spoons to coat the chicken., ",
        "ingredients": "2 tablespoons brown sugar, 2 tablespoons brown sugar, 3 1/3 pounds organic chicken drummettes, 1 teaspoon garlic powder, 2 teaspoons ground cumin, Honey, 1 tablespoon kosher salt, Tabasco Sauce, 2 tablespoons taco seasoning(Trader Joes's brand), 3 tablespoons vegan cream cheese, 2 tablespoons coconut yogurt, ",
        "image": "https://img.spoonacular.com/recipes/638420-556x370.jpg"
    },
    "Chicken Satay": {
        "title": "Chicken Satay",
        "recipe_id": "638308",
        "instructions": "Soak 20 bamboo skewers for at least 2 hours in a glass of water. This is to prevent the sticks from burning and breaking when placed under the grill or over the coals., Add the ground coriander, ground cumin, turmeric powder, chilli powder, salt, saugar, coconut cream and vegetable oil in a large bowl., Mix well., Cut the chicken into long thin strips.Marinate the chicken in the sauce. Ensure the chicken are well coated.Tightly seal the bowl with cling wrap and place in the fridge. Leave to marinade for at least 4 hours. The longer, the better.In the meantime, prepare the sauce.Look for a reputable brand of satay sauce. I always use Lee Kum Kee., Add about 6 tablespoons of the satay sauce into a bowl.The rest of these steps are to be done, subject to taste. I like to taste as I add the other condiments., Add the crunchy peanut butter, coconut cream and water. If the sauce is too thick, thin it down with a little more water., Add the dark soy sauce, sugar and ground peanuts, Seal the bowl with cling wrap and set aside until ready to serve. Before serving, warm the satay sauce in the microwave oven, covered slightly, for approximately 1.5 to 2mins.When you are ready to grill the chicken, start forming satays by piercing the chicken through the bamboo skewers. I find it alot easier to pierce the meat into the sticks when they are long strips and I pierce through in an undulating manner.  Set aside until ready to use.Preheat your oven to 200 deg Celsius at GRILL., Place your oven shelf higher and closer to the top too., Lay the satay sticks on a cooling mesh sitting over a flat baking sheet to collect drippings., Place the tray of satay under the grill. And grill for 10 to 20 mins. It really depends on how thick your chicken sticks are., Remove the tray from the oven when one side of the satay is a golden brown (not dark brown!). Turn over the satay to the other side. And continue to grill till it has a nice dark golden brown. I like it a little burnt., Serve warm with satay sauce and sliced cucumber., ",
        "ingredients": "500 grams chicken thigh meat (with fat), 500 grams chicken thigh meat (with fat), 1 teaspoon chilli powder, 3/4 cup coconut cream, 6 tablespoons coconut cream, 1 tablespoon crunchy peanut butter, 1 tablespoon ground coriander, 1 1/2 tablespoons ground cumin, 1/2 cup of ground peanuts, 1 jar of ready made satay sauce (about 6 tablespoons), 1 teaspoon salt, 2 teaspoons dark soy sauce, 1 teaspoon sugar, 2 teaspoons sugar, 2 teaspoons turmeric powder, 1/4 cup vegetable oil, 1/4 cup water, ",
        "image": "https://img.spoonacular.com/recipes/638308-556x370.jpg"
    },
    "Chicken Fingers": {
        "title": "Chicken Fingers",
        "recipe_id": "638086",
        "instructions": "Preheat oven to 400 degrees, Line a baking sheet with parchment paper or line the bottom with foil and place a cookie rack on top and spray with cooking spray, set aside, In a shallow bowl add egg whites and water, In another shallow bowl add cornflakes, cheese, and seasonings, stir until combined, Cut chicken breasts horizontally and then cut into strips.Dredge the chicken in egg whites, then dip into cornflake mixture., Place on baking sheet. Do the same for all the chicken., Bake for 18 minutes or until chicken is done., ",
        "ingredients": "1 dash Cayenne Pepper, 1 pound Boneless Chicken Breasts, 1 1/2 cup Cornflakes,crushed, 1 whole Egg White, 1/4 teaspoons Italian Seasoning, 1/4 teaspoons Paprika, 2 teaspoons Parmesan Cheese, 1 Tablespoon Water, ",
        "image": "https://img.spoonacular.com/recipes/638086-556x370.jpg"
    },
    "Goat Cheese Stuffed Bacon Wrapped Jalapeno Appetizer": {
        "title": "Goat Cheese Stuffed Bacon Wrapped Jalapeno Appetizer",
        "recipe_id": "644958",
        "instructions": "Slice the tops off of the jalapenos and discard. Scrape and rinse out as many seeds as possible from the jalapenos.Evenly divide up the goat cheese between the 6 peppers and fill each jalapeno with the cheese.Wrap one slice of bacon around each pepper and set aside. Once all peppers are filled and wrapped, place the peppers on a medium-high grill and cook until bacon is fully cooked. Or place peppers on a sheet tray and bake at 350 F for 20 minutes., ",
        "ingredients": "6 slices thick sliced bacon, 3 ounces Goat cheese, 6 jalapenos, ",
        "image": "https://img.spoonacular.com/recipes/644958-556x370.jpg"
    },
    "Classic French Mussels": {
        "title": "Classic French Mussels",
        "recipe_id": "639599",
        "instructions": "Scrub mussels with a stiff brush, discard any that are open and stay that way even when you close the shell. Discard any with broken shells.Soak them in cool clean water for at least an hour. Mussels are alive and breathing and have taken in sand over time. This allows them to expel the sand.Mussels have a small fibrous \"beard\" that should be removed. Pull it out toward the hinge of the shell to keep from injuring the mussel., Heat the olive oil in a large pot over medium-high heat., Add the shallots and garlic and cook until soft, about 5 minutes., Add the mussels, wine, buttermilk, butter, and parsley and season well with the kosher salt. Give it a good stir, cover the pot, and cook until mussels open and are cooked through, 10 to 15 minutes. Divide the mussels and the juices between 2 bowls and serve with a crusty whole-grain bread to sop up that wonderful sauce., ",
        "ingredients": "1/2 cup dry white wine, 3 sprigs fresh parsley, 4 garlic cloves, finely chopped, Kosher salt, 1/2 cup low-fat buttermilk, 2 pounds mussels, cleaned, 1 Tbs olive oil, 2 shallots, finely chopped, 4 tablespoons unsalted light butter, cut into pieces, ",
        "image": "https://img.spoonacular.com/recipes/639599-556x370.jpg"
    },
    "Apple Brown Betty": {
        "title": "Apple Brown Betty",
        "recipe_id": "632481",
        "instructions": "Put a layer of cubed bread in buttered souffle dish that will hold 1-1/2 quarts., Mix apples, sugar and spices. Cover bread with a layer of apples.Dot with butter; add a little lemon juice and rind. Repeat layers, ending in bread cubes, until dish is well-heaped. Cover and bake in a preheated 375-degree oven for 30 minutes. Uncover and bake until apples are tender and crust golden brown, about 30 more minutes., ",
        "ingredients": "3 cups apples (4 large), pared and thinly sliced, 10 cups apples, peeled, cored and diced, 2 cups cubed homemade bread (no crusts), 3/4 stick butter, melted, 2 tablespoons melted butter, 2 tablespoons butter, in small dots, 1/4 teaspoon cinnamon, 1 1/2 teaspoons cinnamon, 1 lemon, grated rind and juice of, 1/4 teaspoon nutmeg, 1/2 teaspoon nutmeg, 1 cup white sugar, ",
        "image": "https://img.spoonacular.com/recipes/632481-556x370.jpg"
    },
    "Ginger Melon Side Salad [Paleo, AIP]": {
        "title": "Ginger Melon Side Salad [Paleo, AIP]",
        "recipe_id": "1095692",
        "instructions": "Cut melon and cucumber into small chunks.Peel and grate ginger., Place everything into a salad bowl and toss well., ",
        "ingredients": "2 handfuls salad leaves, 1/2 small honeydew melon, cut into small chunks, 1/2 small cucumber, peeled and cut into small chunks, 1 Tablespoon fresh ginger, grated, 2 teaspoons fresh lemon juice, 2 Tablespoons extra virgin olive oil, 1/2 teaspoon sea salt (or to taste), ",
        "image": "https://img.spoonacular.com/recipes/1095692-556x370.jpg"
    },
    "Beef Carrot Stew": {
        "title": "Beef Carrot Stew",
        "recipe_id": "769754",
        "instructions": "Scrape, wash and boil your carrots till soft., Place in a blender without water and grind till completely shredded.In a pot, heat up your oil and fry your onions, garlic and ginger., Pour in your Tatashe-pepper mix and your beef and allow to simmer on low heat for about 10-15 minutes.Season with curry, seasoning cubes and anything else you may wish to add., Pour in your carrots and stir in and allow to simmer on low heat for another 3-5 minutes., Add your chopped scent leaves and stir in and serve hot with rice, yam, plantain, pasta or any other accompaniment of your choice. , ",
        "ingredients": "1 tablespoon of chopped Scent leaves, 8 Pieces of medium Beef (Seasoned and Boiled), 7 medium pieces of Carrots, 1/2 teaspoon of Curry, 1 clove of Garlic, 1 teaspoon of grated Ginger, Seasoning cubes, 1 small bulb of Onion, 2 cooking spoons of Blended Tatashe-Pepper Mix (Bell peppers and scotch bonnet peppers), 2 Cooking spoons of Vegetable Oil, ",
        "image": "https://img.spoonacular.com/recipes/769754-556x370.jpg"
    },
    "Chicken In A Pot": {
        "title": "Chicken In A Pot",
        "recipe_id": "638125",
        "instructions": "Adjust oven rack to lowest position and pre- heat oven to 250 degrees, Rinse chicken under cold water and pat dry. Season well with salt and pepper on each side, Heat olive oil in large Dutch Oven (9 quarts), over medium heat. Do not allow oil to smoke, Place chicken breast side down. Cook until breast is lightly browned, about 5 minutes, Using a wooden spoon inserted into cavity of the bird and flip chicken breast side up, add remaining ingredients except lemon juice, and cook about 6 to 8 minutes, Remove from heat., Place a large aluminum sheet over the pot, place the lid on top. This is to ensure a tight seal, so that no vapors escape during the cooking process, Transfer the Dutch Oven in your pre heated oven. Cook approximately 1:30 minutes, Removed pot from the oven and check the chicken internal temperature (must be at least 160 degrees), Remove chicken and place onto a carving board, tent with foil and allow to rest about 20 minutes, Strain chicken juices from the pot through a fine mesh., Place the juices into a fat separator, Pour the juices into a saucepan (discard any of the fat left in the separator), add lemon juice and any juices from the carving board.  Cook approximately 5 minutes and serve!, ",
        "ingredients": "1 4 ½ to 5 pounds Whole chicken (Organic, preferred), 2 teaspoons of Kosher salt or 1 teaspoon of table salt. Kosher salt, 1/4 teaspoon ground black pepper, 1 tablespoon of olive oil, 1 about ½ cup small onion, chopped, 1 about ¼ cup small stalk celery, chopped, 6 mediums garlic cloves, peeled and trimmed, 5 smalls bay leaves, 4 sprigs thyme or rosemary (optional), 1/2 lemon juice, ",
        "image": "https://img.spoonacular.com/recipes/638125-556x370.jpg"
    }
}