{
    "635675": {
        "title": "635675",
        "recipe_id": "635675",
        "instructions": "Cut orange, peppers, onion & broccoli into large bite-sized chunks (at least 1\" thick) and place in the dish.\r\nAdd mushrooms and tomatoes.Stir veggies in marinade to coat.Cover and refrigerate while you prep chicken.Warm outdoor grill to medium heat.Rinse chicken and pat dry with paper towel (toss that towel!).In small bowl mix mustard, salt and pepper.\r\nBrush chicken with mustard mixture.Wash your hands and go stir those veggies so all sides absorb the marinade.When beer is half empty, refill can with salad dressing and squeeze in juice from 1/2 lemon.Put can on a disposable baking sheet.\r\nPlace upright chicken on can like a stand, inserting can into cavity of chicken.\r\nPlace baking sheet with beer and chicken on the preheated grill.Cover. Set your time for 1 hour.Start on a second beer or that remaining white wine.In a medium saucepan, pour rice, water, and 3-4 splashes of your beverage (about 1/4 cup) into medium sauce pan.Bring to a boil, stir and reduce heat to low.Cover with lid and cook for 25-30 minutes.Back to the kebabs.\r\nRemove veggies from fridge and using the sharp end of the skewer begin threading.Distribute veggies evenly onto 6-8 skewers.Check rice: It's done when all liquid is absorbed but before it starts sticking to the bottom of the pan.Turn off heat under the rice and let it sit.Go back to grill.You should be at about an hour on the chicken.Carefully slice in to see meat has gone from pink to white.\r\nRemove from grill\r\nAllow to cool for at least 15 minutes so you don't burn the hell out of yourself cutting it into pieces for your guest(s).In the meantime throw those kebabs directly on the grill.Flip them over after about 5 minutes to get the other side and allow to cook for another 5-8min.Kebabs are done when veggies are al dente (softened but still firm).Turn off grill and remove from heat.Put rice in a serving dish, and chicken pieces and full skewers on a platter. Squeeze remaining lemon juice over chicken.\r\nLet people serve themselves.Eat, drink and be merry!DW | Food and Drink",
        "ingredients": "1/4 cup beer or white wine\r\n12 ounces can of your favorite beer (I sugggest Hefeweizen's complementary fruity flavor)\r\nLarge head broccoli\r\n1 1/2 cups slow cook brown rice\r\n12 cherry tomotoes\r\n3/4 cup Dijon mustard\r\n1 tablespoon fresh ginger or 1 tbsp wet ginger from a jar (no powder!)\r\n1 tablespoon clove fresh garlic (minced) or 1 wet garlic from a jar (no powder!)\r\n1 green pepper\r\n2 tablespoons fresh ground pepper\r\n1 juicy lemon\r\n1/4 cup low sodium soy sauce\r\n2 tablespoons molasses\r\n12 bite sized mushrooms\r\n1/4 cup olive oil\r\n1 large orange\r\n1/2 cup orange juice (or tablespoon/mash another orange\r\n1/2 teaspoon pepper\r\n1 red pepper\r\n1 red onion\r\n1/2 cup Newman's Own Low-Fat Italian Salad Dressing\r\n1 tablespoon salt\r\n2 tablespoons Sriracha or Tabasco sauce\r\n3 1/2 cups water\r\n1/4 cup white wine\r\n1 whole chicken (about 3 lbs)\r\nWooden skewers\r\nWooden skewers",
        "image": "https://img.spoonacular.com/recipes/635675-556x370.jpg"
    },
    "658607": {
        "title": "658607",
        "recipe_id": "658607",
        "instructions": "Preheat oven to 375 F.\r\nBrush a large shallow baking dish with olive oil.\r\nLaying them cut-sized down, arrange the tomatoes, bell peppers, zucchini and eggplant in one layer (use two dishes if necessary).\r\nTuck the garlic cloves and onion pieces into the gaps and drizzle the vegetables with the remaining olive oil.\r\nSeason lightly with salt and pepper and sprinkle with thyme.\r\nPlace in preheated oven and bake uncovered, for 30-35 minutes, or until soft and browned around the edges.\r\nLet cool, then scrape out the eggplant flesh and remove the skin from the bell peppers.\r\nWorking in batches, put the eggplant and bell pepper flesh, together with the tomatoes, zucchini, garlic and onion place into a bowl and chop together using a knife.\r\nCombine the stock and chopped vegetable mixture in a saucepan and simmer over medium heat for 20-30 minutes, until all the vegetables are tender and the flavors have completely blended.\r\nStir in the cream and simmer over low heat for about 5 minutes, stirring occasionally until hot.\r\nTaste and adjust the seasoning if needed. Ladle the soup into warm bowls, garnish with basil and serve.",
        "ingredients": "3 tablespoons oil\r\n1 lb 9 oz ripe tomatoes, skinned, cored and halved\r\n3 large yellow bell peppers. seeded and halved\r\n3 zucchini, halved lengthwise\r\n4 garlic cloves, halved\r\n2 onion, cut into eights\r\npinch of thyme\r\n6 cups vegetable stock\r\n1/2 cup cream or non-dairy creamer like MimicCreme\r\nsalt and pepper\r\nshredded basil leaves for garnish",
        "image": "https://img.spoonacular.com/recipes/658607-556x370.jpg"
    },
    "12545": {
        "title": "12545",
        "recipe_id": "12545",
        "instructions": "bbbbb",
        "ingredients": "aaaaa",
        "image": "https://cdn.oaistatic.com/assets/sora-mutf8tav.webp"
    },
    "57810": {
        "title": "57810",
        "recipe_id": "57810",
        "instructions": "Cook onions in bacon drippings until tender.\r\nRemove from heat, add pork backs (or your choice).\r\nCut pork shoulder roll crosswise, 3/4 inch slices, add slices, or loin, to Dutch oven.\r\nMix kraut, apples, brown sugar, cloves, berries, garlic, bay leaf and pepper. Spoon over meat.\r\nPour wine over all. Cover and bake at 375 degrees for 2 1/2 hours, until tender.",
        "ingredients": "1 . onion, sliced\r\n3 juniper berries, crushed, optional\r\n2 cloves garlic, minced\r\n1 bay leaf\r\n1/8 teaspoon freshly ground pepper\r\n1 1/2 cups Rhine wine\r\n1 pound sausage links, two skins i.e., knockwurst/bratwurst fresh or precooked\r\n1 pound Boiled potatoes\r\n1 tablespoon bacon drippings\r\n3 fresh pork backs 1 1/2 lbs. or 2 lbs. pork spareribs 2 lbs. smoked pork shoulder roll or 3 to 4 smoke 3 16 oz. cans sauerkraut rinsed and drained 2 cooking apples, peeled, cored and cut into wedges 2 tablespoons brown sugar 4 whole cloves\r\n2 lbs. smoked pork shoulder roll or 3 to 4 smoke\r\n3 16 oz. cans sauerkraut rinsed and drained\r\n2 cooking apples, peeled, cored and cut into wedges\r\n2 tablespoons brown sugar\r\n4 whole cloves\r\n1Cook onions in bacon drippings until tender. Remove from heat, add pork backs (or your choice). Cut pork shoulder roll crosswise, 3/4 inch slices, add slices, or loin, to Dutch oven. Mix kraut, apples, brown sugar, cloves, berries, garlic, bay leaf and p\r\n2FRESH SAUSAGES: Place in unheated skillet with 2 to 3 tbsp. water, cover, cook over low heat 5 to 8 minutes; uncover, cook 5 to 8 minutes longer.\r\n3PRECOOKED SAUSAGES: Add to boiling water in saucepan, cover, simmer until heated through. Pour sauerkraut on platter, top with meats and sausages, add potatoes. May be served separately. Delicious!",
        "image": "https://img.spoonacular.com/recipes/57810-556x370.jpg"
    },
    "654571": {
        "title": "654571",
        "recipe_id": "654571",
        "instructions": "Spray 6 ramekins or juice glasses with the nonstick cooking spray.\r\nAdd the half and half to a saucepan over low-medium heat (dont let the mixture get too hot or come to a boil).\r\nWhen warm, sprinkle the gelatin over the mixture, and stir it to dissolve it.\r\nAdd the mascarpone and stir until melted.\r\nAdd the sugar, orange zest and vanilla, and stir until the sugar is dissolved.\r\nRemove from the heat and let it stand for about 5 minutes.\r\nPour the mixture evenly into the ramekins or glasses.\r\nCover and refrigerate for at least four hours, but ideally overnight.\r\nMeanwhile, put the raspberries in a bowl and press them softly with a fork to produce some juice.\r\nAdd the orange juice and confectioners sugar and mix together. Keep the berry mixture refrigerated until youre ready to serve the panna cotta.\r\nWhen the panna cotta has set, move a knife around the edges of the ramekin or glasses to loosen it, and gently shake each onto individual plates.\r\nDrizzle the berry mixture over each serving.",
        "ingredients": "4 cups of half and half\r\n1/2 cup mascarpone\r\n1/2 cup sugar\r\n1-1/2 teaspoons vanilla\r\n1 tablespoon powdered unflavored gelatin\r\nZest from 1 orange\r\n2 cups fresh raspberries (or frozen, thawed)\r\n2 teaspoons orange juice\r\n1-2 tablespoons confectioners sugar",
        "image": "https://img.spoonacular.com/recipes/654571-556x370.jpg"
    },
    "637184": {
        "title": "637184",
        "recipe_id": "637184",
        "instructions": "Peel and grate the carrots. If you end up having more than 1 cup of grated carrots from the 3-4 medium carrots, thats OK, this recipe can easily handle up to 1.5 cups of grated carrots.\r\nMicrowave the grated carrots for 3 minutes on medium, or until the carrots are soft and partially cooked.\r\nMix together the dry ingredients in a large bowl  flour, baking powder, salt, and spices.\r\nWhisk together the wet ingredients in a bowl until well combined  melted butter, sugar, egg, milk, and vanilla extract.\r\nAdd the wet ingredients to the dry ingredients and whisk together until almost combined.\r\nAdd the grated carrots and raisins/walnuts if youre using those. Stir until everything is combined, but do not overmix!\r\nHeat some oil or butter in a skillet. Use heaping tablespoons (or an ice cream scoop!) to add the pancake batter to the pan. Cook about 2-3 minutes on medium/low heat, or until little bubbles start forming at the surface. Flip each pancake, and cook about 2-3 minutes on the other side, or until the inside is fully cooked.\r\nServe warm with butter, syrup, powdered sugar  whatever you want!",
        "ingredients": "1 cup grated carrots (about 3-4 medium carrots)\r\n1 1/2 cups white whole wheat flour\r\n1 tablespoon baking powder\r\n1/2 teaspoon salt\r\n1 teaspoon cinnamon\r\n1/4 teaspoon ground nutmeg\r\npinch of ground allspice\r\n4 tablespoons butter, melted\r\n1 egg\r\n1 1/2 cups milk\r\n3 tablespoons turbinado or other brown sugar\r\n1 teaspoon vanilla extract\r\nOptional: 1/2 cup raisins or crushed walnuts/pecans (or a combination)",
        "image": "https://img.spoonacular.com/recipes/637184-556x370.jpg"
    },
    "11532": {
        "title": "11532",
        "recipe_id": "11532",
        "instructions": "dddd",
        "ingredients": "nnnnn",
        "image": ""
    },
    "650482": {
        "title": "Luscious Lemon Soufflé Pudding",
        "recipe_id": "650482",
        "instructions": "Preheat the oven to 325F (170C). Butter 6 individual ramekins or pyrex bowls.\r\nRemove and set aside 2 Tbs of the sugar.Separate the eggs: place the yolks in a large mixing bowl and the whites place in a separate bowl preferably plastic or metal.Cream the butter with the rest of the sugar (1 cup less the 2 Tbs) until blended and fluffy.Beat in the yolks, one at a time, beating after each addition until blended.Beat in the vanilla and the lemon zest.\r\nAdd the flour and the salt and beat just until combined.With the mixer on low, beat in the milk and the lemon juice. It will be very liquid.In the separate bowl with very clean beaters, beat the egg whites with the cream of tartar until foamy and then until soft peaks form.Continue beating the whites as you gradually add the 2 tablespoons sugar. Beat until stiff peaks form.Fold the whites into the yolk/lemon batter just until incorporated and you have no more chunks of whites.Using a ladle, fill the 6 ramekins with the batter almost to the top.\r\nPlace the filled ramekins in a large baking pan (placing a piece of newspaper on the bottom of the pan keeps the water of the water bath from boiling) and very carefully (so as not to get any water in the lemon batter) fill the pan with hot water, so that the water is halfway up the ramekins. If you like, place the baking pan in the oven and then pour in the water; this will avoid you having to lift and move the baking pan after it is filled and risk splashing the water into the batter.\r\nBake for 40  45 minutes. The tops will be puffed up, maybe  to 1 inch (1  2 cm) above the rim of the ramekins, and a deep golden brown.\r\nRemove the baking pan from the oven then carefully remove the ramekins from the water bath onto a kitchen towel.Allow to cool slightly before serving. Like a souffl, the tops will sink a bit when cooling.\r\nServe hot or warm  they can be eaten later but are best when fresh from the oven or just slightly cooled  with a sprinkling of powdered sugar or a dollop of whipped cream.",
        "ingredients": "3 tablespoons (45 g) unsalted butter softened to room temperature\r\n1/8 teaspoon cream of tartar\r\n3 eggs\r\ncup (50 g) flour\r\n2 tablespoons Lemon Juice\r\n1 tablespoon lemon zest\r\npowdered sugar\r\nSalt to Taste\r\n1 cup (200 g) sugar, divided\r\n1 teaspoon vanilla\r\n1 cup whole milk (I used half low fat milk + half light cream)",
        "image": "https://img.spoonacular.com/recipes/650482-556x370.jpg"
    }
}