{
    "chicken wings": {
        "title": "chicken wings",
        "recipe_id": "https://images.immediate.co.uk/production/volatile/sites/30/2020/12/Air-Fryer-Chicken-Wings-d2c6fa4.jpg?quality=90&resize=556,505",
        "instructions": "45678",
        "ingredients": "bla bla bla",
        "image": "ja ja ja"
    },
    "cheese sticks": {
        "title": "cheese sticks",
        "recipe_id": "999876",
        "instructions": "cheese and sticks",
        "ingredients": "cheese milk apple ",
        "image": "none"
    },
    "Lemon Pie": {
        "title": "Lemon Pie",
        "recipe_id": "649730",
        "instructions": "Whip milk until thick, add condensed milk.   Thoroughly mix then add lemon juice., Pour in graham cracker crust.Chill and serve. Vanilla wafer crust is also good., ",
        "ingredients": "1 Graham cracker crust, 1/2 cup lemon juice and a little grated rind, 1 can carnation milk cold, 1 can sweetened condensed milk, ",
        "image": "https://img.spoonacular.com/recipes/649730-556x370.jpg"
    },
    "Beef Tataki": {
        "title": "Beef Tataki",
        "recipe_id": "634698",
        "instructions": "For 4 people, Heat grid well., Place beef on grid and grill on all sides. When the surface turns light brown, dip in ice water for a few seconds. Dry with a cloth, wrap in Saran Wrap and place in the refrigerator.Prepare condiments., Cut lemon into 8 wedges. Pare daikon in paper thin sheets, cutting with bottom part of knife while rotating the daikon., Roll daikon sheet and slice thinly crosswise, thus making very thin and long strips. Do the same with cucumber., Cut beef into thin slices., Place daikon strip, cucumber and beef slices in a serving dish. Put other condiments on the side., Place scallions on beef., Pour soy sauce into small individual serving dishes and add condiments to taste. The beef is dipped lightly in the soy sauce., ",
        "ingredients": "3/4 pound beef, tenderloin, 1 Japanese cucumber, 7 ounces daikon (Japanese radish), 2 teaspoons grated fresh ginger, 5 cloves garlic, minced, 1 lemon, Shiso leaves, Soy sauce, ",
        "image": "https://img.spoonacular.com/recipes/634698-556x370.jpg"
    },
    "hot dog": {
        "title": "hot dog",
        "recipe_id": "",
        "instructions": "",
        "ingredients": "",
        "image": "https://assets.tmecosys.com/image/upload/t_web767x639/img/recipe/ras/Assets/21861ad1f03b6136a02bf810234cd666/Derivates/d257bb4fe192628f00a98b1f08a7976fbf7f21d4.jpg"
    }
}