{
    "xxxxxxxx": {
        "title": "xxxxxxxx",
        "recipe_id": ";ppppppppppp",
        "instructions": "1234",
        "ingredients": "kiiiiiiiiiii",
        "image": "loooooooooo"
    },
    "chicken wings": {
        "title": "chicken wings",
        "recipe_id": "https://images.immediate.co.uk/production/volatile/sites/30/2020/12/Air-Fryer-Chicken-Wings-d2c6fa4.jpg?quality=90&resize=556,505",
        "instructions": "45678",
        "ingredients": "bla bla bla",
        "image": "ja ja ja"
    },
    "cheese sticks": {
        "title": "cheese sticks",
        "recipe_id": "999876",
        "instructions": "cheese and sticks",
        "ingredients": "cheese milk apple ",
        "image": "none"
    },
    "carrot cake": {
        "title": "carrot cake",
        "recipe_id": "234567",
        "instructions": "f you have a couple of bowls and can stir ingredients together, you can make this easy cake! You’ll start by whisking the dry ingredients in one bowl, and do the same with the wet ingredients in another.\r\n\r\nMaking this cake batter reminds me of making pancakes or muffins. All you need to do is fold the dry ingredients into the wet, add your carrots, nuts, and raisins, and you are done. It’s that easy!",
        "ingredients": "Flour: I use all-purpose flour, but this recipe works with spelt flour or your favorite gluten-free flour blend for a gluten-free carrot cake.\r\nBaking soda: Helps our cake rise. We don’t add baking powder (this cake recipe does not need it). Check that your baking soda has not been open for longer than 6 months (it loses its potency after that).\r\nSugar: Makes carrot cake moist and delicious. I love a combination of white and brown sugar. If you only want to use one, choose brown sugar since it has the necessary acid to react with the baking soda.\r\nOil: The secret to keeping our carrot cake so deliciously moist. I’ve used avocado oil, safflower oil, and vegetable oil with great results. Melted coconut oil works, too, but the baked cake will have a light coconut flavor.\r\nSalt, cinnamon, and vanilla extract: Make our cake taste amazing, resulting in a lightly spiced cake.\r\nEggs: This cake calls for 4 eggs, which add flavor, moisture, and give the cake structure.\r\nCarrots: Three cups of freshly grated carrots make this the best carrot cake! If you’re making the carrot cake and start to second-guess the number of carrots called for in our recipe, don’t. You need all three cups. It is a carrot cake, after all.\r\nPecans and Raisins: These add texture, but they are optional. Reading through the comment section, it is clear that some people love nuts and raisins in carrot cake, while others cannot stand them. I love them, but add what you love!",
        "image": "aaa"
    },
    "Lemon Pie": {
        "title": "Lemon Pie",
        "recipe_id": "649730",
        "instructions": "Whip milk until thick, add condensed milk.   Thoroughly mix then add lemon juice., Pour in graham cracker crust.Chill and serve. Vanilla wafer crust is also good., ",
        "ingredients": "1 Graham cracker crust, 1/2 cup lemon juice and a little grated rind, 1 can carnation milk cold, 1 can sweetened condensed milk, ",
        "image": "https://img.spoonacular.com/recipes/649730-556x370.jpg"
    }
}