{
    "634629": {
        "title": "634629",
        "recipe_id": "634629",
        "instructions": "Drop noodles into a large quantity of boiling water and cook 3-5 minutes, until barely tender to the bite., Drain, rinse with cold water and reserve., Combine the beef and oyster sauce in a bowl; stir to coat., Let stand for 10 minutes., In another bowl, combine the chicken broth, soy sauce and sesame oil. Set aside., Heat a wok over high heat. When hot, add the vegetable oil, swirling to coat the sides., Add the garlic, ginger, and green onions and cook, stirring until fragrant, about 30 seconds., Add the beef and cook, stirring constantly, about 1 minute., Add the sauce and noodles., Gently toss until heated through and sauce has thickened., Serve immediately., ",
        "ingredients": "8 ounces dried Chinese egg noodles or soba (buckwheat) noodles, 3/4 pound flank steak, trimmed of any fat and cut into thin strips, 1 tablespoon oyster sauce, 1/2 cup chicken stock, 2 tablespoons soy sauce, 2 teaspoons sesame oil, 3 tablespoons vegetable oil, 2 teaspoons garlic, minced, 2 teaspoon ginger, minced, 1/4 cup green onions, chopped, ",
        "image": "https://img.spoonacular.com/recipes/634629-556x370.jpg"
    },
    "638086": {
        "title": "638086",
        "recipe_id": "638086",
        "instructions": "Preheat oven to 400 degrees, Line a baking sheet with parchment paper or line the bottom with foil and place a cookie rack on top and spray with cooking spray, set aside, In a shallow bowl add egg whites and water, In another shallow bowl add cornflakes, cheese, and seasonings, stir until combined, Cut chicken breasts horizontally and then cut into strips.Dredge the chicken in egg whites, then dip into cornflake mixture., Place on baking sheet. Do the same for all the chicken., Bake for 18 minutes or until chicken is done., ",
        "ingredients": "9 dash Cayenne Pepper, 1 pound Boneless Chicken Breasts, 1 1/2 cup Cornflakes,crushed, 1 whole Egg White, 1/4 teaspoons Italian Seasoning, 1/4 teaspoons Paprika, 2 teaspoons Parmesan Cheese, 1 Tablespoon Water, and some LOVE",
        "image": "https://img.spoonacular.com/recipes/638086-556x370.jpg"
    },
    "642809": {
        "title": "642809",
        "recipe_id": "642809",
        "instructions": "Rinse, dry (spin or lay on a towel to air-dry) salad greens. Tear into bite-size pieces if necessary.Slice the figs.Roughly chop the walnuts.Take a small spoon and lightly drop small pieces of the goat cheese over the salad., Drizzle the dressing over the salad. You can mix the olive oil and lemon juice using the measurements above as a guide or just drizzle them over the salad before serving., ",
        "ingredients": "5 fresh figs, sliced, 10 teaspoons soft goat cheese, 2 tablespoons lemon juice, 3 cups torn lettuce or mixed greens, one small head of lettuce, 2 tablespoons olive oil, salt and pepper to taste, 1 handful (1/2 cup/125 ml) walnuts, roughly chopped into halves or quarters,",
        "image": "https://img.spoonacular.com/recipes/642809-556x370.jpg"
    },
    "644965": {
        "title": "644965",
        "recipe_id": "644965",
        "instructions": "",
        "ingredients": "",
        "image": "https://img.spoonacular.com/recipes/644965-312x231.jpg"
    },
    "638174": {
        "title": "638174",
        "recipe_id": "638174",
        "instructions": "",
        "ingredients": "",
        "image": "https://img.spoonacular.com/recipes/638174-312x231.jpg"
    },
    "638308": {
        "title": "638308",
        "recipe_id": "638308",
        "instructions": "Soak 20 bamboo skewers for at least 2 hours in a glass of water. This is to prevent the sticks from burning and breaking when placed under the grill or over the coals., Add the ground coriander, ground cumin, turmeric powder, chilli powder, salt, saugar, coconut cream and vegetable oil in a large bowl., Mix well., Cut the chicken into long thin strips.Marinate the chicken in the sauce. Ensure the chicken are well coated.Tightly seal the bowl with cling wrap and place in the fridge. Leave to marinade for at least 4 hours. The longer, the better.In the meantime, prepare the sauce.Look for a reputable brand of satay sauce. I always use Lee Kum Kee., Add about 6 tablespoons of the satay sauce into a bowl.The rest of these steps are to be done, subject to taste. I like to taste as I add the other condiments., Add the crunchy peanut butter, coconut cream and water. If the sauce is too thick, thin it down with a little more water., Add the dark soy sauce, sugar and ground peanuts, Seal the bowl with cling wrap and set aside until ready to serve. Before serving, warm the satay sauce in the microwave oven, covered slightly, for approximately 1.5 to 2mins.When you are ready to grill the chicken, start forming satays by piercing the chicken through the bamboo skewers. I find it alot easier to pierce the meat into the sticks when they are long strips and I pierce through in an undulating manner.  Set aside until ready to use.Preheat your oven to 200 deg Celsius at GRILL., Place your oven shelf higher and closer to the top too., Lay the satay sticks on a cooling mesh sitting over a flat baking sheet to collect drippings., Place the tray of satay under the grill. And grill for 10 to 20 mins. It really depends on how thick your chicken sticks are., Remove the tray from the oven when one side of the satay is a golden brown (not dark brown!). Turn over the satay to the other side. And continue to grill till it has a nice dark golden brown. I like it a little burnt., Serve warm with satay sauce and sliced cucumber., ",
        "ingredients": "500 grams chicken thigh meat (with fat), 500 grams chicken thigh meat (with fat), 1 teaspoon chilli powder, 3/4 cup coconut cream, 6 tablespoons coconut cream, 1 tablespoon crunchy peanut butter, 1 tablespoon ground coriander, 1 1/2 tablespoons ground cumin, 1/2 cup of ground peanuts, 1 jar of ready made satay sauce (about 6 tablespoons), 1 teaspoon salt, 2 teaspoons dark soy sauce, 1 teaspoon sugar, 2 teaspoons sugar, 2 teaspoons turmeric powder, 1/4 cup vegetable oil, 1/4 cup water, ",
        "image": "https://img.spoonacular.com/recipes/638308-556x370.jpg"
    },
    "716435": {
        "title": "716435",
        "recipe_id": "716435",
        "instructions": "",
        "ingredients": "1 cup caramelized onions, 2 T dill, 1 T parsley, 0.25 cup chives, 4 ounce goat cheese, 1 cup greek yogurt, 1 serving steak seasoning",
        "image": "https://img.spoonacular.com/recipes/716435-312x231.jpg"
    },
    "639672": {
        "title": "639672",
        "recipe_id": "639672",
        "instructions": "In a medium bowl, combine the shrimp, grapes, celery, water chestnuts and the sliced whites of the green onion. In a small bowl, combine the mayonnaise, sherry, salt, pepper, sesame oil and dry mustard. Gently mix with shrimp and grape mixture. Sprinkle with the sliced green part of the onion and the sesame seeds. Refrigerate until ready to serve. Serves",
        "ingredients": "1 pound pink bay shrimp, 1 cup california grapes, 0.5 cup celery, 0.5 cup water chestnuts, 2  green onions, 2 tablespoons mayonnaise, 2 tablespoons sherry, 0.25 teaspoon salt, 0.25 teaspoon pepper, 3 drops sesame oil, 1 pinch mustard, 1 tablespoon sesame seeds",
        "image": "https://img.spoonacular.com/recipes/639672-312x231.jpg"
    },
    "id_ga2jojunz": {
        "title": "id_ga2jojunz",
        "recipe_id": "id_ga2jojunz",
        "instructions": "A rakott krumpli elkészítéséhez a krumplikat 10-15 percre beáztatjuk hideg vízbe, majd alaposan megsikáljuk és leöblítjük. A tojásokat megmossuk. A krumplit annyi hideg vízzel öntjük fel, hogy bőven ellepje. Hozzáadjuk a sót, és a forrástól számított 20 percig, fedő alatt puhára főzzük. A tojásokat sós, hideg vízben feltesszük főni, és a forrástól számított 8 percig főzzük, majd hideg vízbe merítve azonnal lehűtjük. A krumpliról leöntjük a vizet, még melegen meghámozzuk, és hűlni hagyjuk.",
        "ingredients": "16 krumpli,tojás, só, kolbász, tejföl, tojássárgája, vaj, bacon",
        "image": "https://www.mindmegette.hu/images/359/XL/lead_XL_rakott-krumpli-recept.jpg"
    },
    "645175": {
        "title": "645175",
        "recipe_id": "645175",
        "instructions": "Preheat oven to 300F degrees. Mix together the oats, sesame seeds almonds and sunflower seeds. Pour honey, oil Water over this mixture and stir well. Spread on a large cookie sheet and bake 35 minutes until nicely browned on top.Stir the granola often while baking (about every 5 minutes). Remove from oven allow to cool and add raisins, coconut and crasins.Makes 6 cups. Nutritional information is for 1/3 cup serving.",
        "ingredients": "0.5 cup almonds, 0.75 cup coconut, 0.75 cup craisins, 1 cup honey, 0.75 cup raisins, 4 cups rolled oats, 0.5 cup sesame seeds, 1 cup sunflower oil, 0.75 cup sunflower seeds, 2 tablespoons water",
        "image": "https://img.spoonacular.com/recipes/645175-312x231.jpg"
    },
    "id_n82d3wj3v": {
        "title": "id_n82d3wj3v",
        "recipe_id": "id_n82d3wj3v",
        "instructions": "A mákos guba elkészítéséhez a kifliket 1 cm-es karikákra vágjuk.\r\nA tejet a vaníliás cukorral felforraljuk.\r\nA kiflikarikákat a forró tejjel leöntjük, majd leszűrjük, és kinyomkodjuk belőle a tejet.\r\nEgy nagyobb jénai tálba egy réteg kiflit teszünk, majd porcukorral elkevert darált mákot szórunk rá, megint kiflit és megint mákot teszünk bele, amíg elfogynak a hozzávalók. Ha marad még mák, megszórjuk vele a tetejét is.\r\nHa szeretnénk, akkor 7-8 percre berakhatjuk 180 fokra előmelegített sütőbe. Összemelegítve, sütve is nagyon finom, de ha nem akarjuk sütni, a mákos guba úgyis fogyasztható. ",
        "ingredients": "10db\tszikkadt kifli\t\r\n1liter\ttej\t\r\n1csom\tvaníliás cukor\t\r\n15ek\tdarált mák\t\r\n7ek\tporcukor",
        "image": "https://budapestnewyear.com/wp-content/uploads/2019/12/11-2.jpg"
    },
    "665642": {
        "title": "665642",
        "recipe_id": "665642",
        "instructions": "To Make Salsa: In a medium bowl, combine watermelon, cucumber, sweet pepper, corn, cilantro and onion. In a small bowl, mix together  cup lime juice, honey, red pepper flakes and salt. Refrigerate for at least 1 hour before serving, to blend flavors.To Make Chicken: In a shallow bowl add the chicken, 3 tablespoons lime juice and sprinkle with a little garlic powder, salt and pepper.  Marinate in the refrigerator for 30 minutes.  Coat a large nonstick pan or a grill pan with olive oil spray, add olive oil and heat., Add chicken, cover, and saut over medium heat until browned on both sides and cooked through, about 10-12 minutes total., Remove the chicken from the pan, To Make Honey Lime Glaze: In a small bowl, mix together  cup lime juice, 2 tablespoons honey and Tabasco., Add the honey lime glaze to the same pan.  Cook for about 30 seconds until melted.  Return cooked chicken to pan, flipping the chicken once to coat with the glaze., Remove from pan and plate each piece.  Spoon watermelon salsa on top of each piece of chicken and serve with more salsa on the side., Serve with our recipe for Simple Garlic Toast, if desired.  Recipe follows.Recipe for Simple Garlic Toast, Start with 4 slices sourdough wheat bread. We bought ours at Trader Joes but most markets sell sourdough wheat bread or use regular sourdough slices., Cut each slice in half and toast all of them., Spread each half with 1 teaspoon reduced-fat butter or Smart Balance Light., Sprinkle each with a little garlic powder., Place all 8 halves on a plate and reheat in microwave for about 15 seconds.Our favorite garlic powder is Lawrys with parsley. Weve been buying it for years because it taste much better than most garlic powders., ",
        "ingredients": "1/2 cup cucumber, peeled and diced, 1 small ear fresh sweet corn, cut from the cob, 1 tablespoon extra virgin olive oil, 2 tablespoons fresh cilantro, chopped, 1/2 teaspoon garlic powder, Fresh ground pepper, 2 tablespoons honey, 2 tablespoons fresh lime juice, 1/2 cup yellow or orange sweet pepper, diced, 3 tablespoons red onion, diced, 1/2 teaspoon crushed red pepper flakes, to taste, 1 teaspoon Salt, 4 chicken breasts (4- 5 ounces each), boneless, skinless, 1 teaspoon Tabasco Sauce, 2 cups watermelon, seeded and diced, ",
        "image": "https://img.spoonacular.com/recipes/665642-556x370.jpg"
    },
    "659581": {
        "title": "659581",
        "recipe_id": "659581",
        "instructions": "Divide sausage into 8 portions. On a lightly crumb sprinkled surface, pat out each portion to about 1/8 inch thickness. Wrap 1 sausage portion completely around 1 hard boiled egg, pressing edges together to seal. Repeat with remaining sausage and hard boiled eggs.Dip sausage-covered eggs in 1 beaten egg and then roll in breadcrumbs.Deep fry or place on baking sheet and bake in a 375 degree oven for 20 minutes until lightly browned., ",
        "ingredients": "1 pound bulk sausage, 1 cup bread crumbs or corn meal, 9 eggs, ",
        "image": "https://img.spoonacular.com/recipes/659581-556x370.jpg"
    },
    "123": {
        "title": "123",
        "recipe_id": "123",
        "instructions": "Test instructions for unique1",
        "ingredients": "ingredient1, ingredient2",
        "image": "http://example.com/unique1.jpg"
    },
    "456": {
        "title": "456",
        "recipe_id": "456",
        "instructions": "Instructions for unique3",
        "ingredients": "ingredientA, ingredientB",
        "image": "http://example.com/unique3.jpg"
    },
    "321": {
        "title": "321",
        "recipe_id": "321",
        "instructions": "Old instructions for unique5",
        "ingredients": "New instructions for unique5",
        "image": "http://example.com/unique5.jpg"
    },
    "234": {
        "title": "234",
        "recipe_id": "234",
        "instructions": "Test instructions for unique2",
        "ingredients": "ingredient1, ingredient2",
        "image": "http://example.com/unique2.jpg"
    },
    "99951": {
        "title": "tester",
        "recipe_id": "99951",
        "instructions": "aaaaaaa",
        "ingredients": "mv SL<",
        "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRKhJ9vY-WJviH34cgDfbG2Hn_cBf0t5BBmaWrmH--NzBO3pjGP6hjV7pb8s958ug9K7p6iR-3vz6nlw7c4i5ZdMw"
    }
}